Revit 2017 API
AssetPropertyTime Class
 Represents a property of DateTime value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyTime : AssetProperty
Visual Basic
Public Class AssetPropertyTime _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyTime : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyTime
See Also
AssetPropertyTime Members
Autodesk.Revit.Utility Namespace